modm-ext/archive-stmicro-svd/header_stm32h755xx.svd
      <register>
        <name>CTCR3</name>
        <addressOffset>0x3a8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SINC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DINC</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SSIZE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DSIZE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SINCOS</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DINCOS</name>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SBURST</name>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DBURST</name>
            <bitOffset>15</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>TLEN</name>
            <bitOffset>18</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>PKE</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PAM</name>
            <bitOffset>26</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>TRGM</name>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SWRM</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BWM</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CDAR2</name>
        <addressOffset>0x3b0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CLAR1</name>
        <addressOffset>0x3b4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CBNDTR3</name>
        <addressOffset>0x3bc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BNDT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>17</bitWidth>
          </field>
          <field>
            <name>BRSUM</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRDUM</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRC</name>
            <bitOffset>20</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CMDR9</name>
        <addressOffset>0x3c0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MDR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CISR4</name>
        <addressOffset>0x3c0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TEIF</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTCIF</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRTIF</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BTIF</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCIF</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRQA</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CIFCR4</name>
        <addressOffset>0x3c4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CTEIF</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CCTCIF</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CBRTIF</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CBTIF</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CLTCIF</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CMAR0</name>
        <addressOffset>0x3cc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CESR4</name>
        <addressOffset>0x3cc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TEA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>TED</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TELD</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TEMD</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ASE</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BSE</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CBRUR2</name>
        <addressOffset>0x3d0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SUV</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>DUV</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSAR3</name>
        <addressOffset>0x3d4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCR4</name>
        <addressOffset>0x3d8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TEIE</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTCIE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRTIE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BTIE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCIE</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PL</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>BEX</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HEX</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WEX</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWRQ</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTBR1</name>
        <addressOffset>0x3dc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSEL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>SBUS</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DBUS</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTCR4</name>
        <addressOffset>0x3e8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SINC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DINC</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SSIZE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DSIZE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SINCOS</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DINCOS</name>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SBURST</name>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DBURST</name>
            <bitOffset>15</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>TLEN</name>
            <bitOffset>18</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>PKE</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PAM</name>
            <bitOffset>26</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>TRGM</name>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SWRM</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BWM</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CDAR3</name>
        <addressOffset>0x3f0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CLAR2</name>
        <addressOffset>0x3f4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CBNDTR4</name>
        <addressOffset>0x3fc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BNDT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>17</bitWidth>
          </field>
          <field>
            <name>BRSUM</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRDUM</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRC</name>
            <bitOffset>20</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CMDR0</name>
        <addressOffset>0x400</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MDR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CISR5</name>
        <addressOffset>0x400</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TEIF</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTCIF</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRTIF</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BTIF</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCIF</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CRQA</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CIFCR5</name>
        <addressOffset>0x404</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CTEIF</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CCTCIF</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CBRTIF</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CBTIF</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CLTCIF</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CMAR1</name>
        <addressOffset>0x40c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CESR5</name>
        <addressOffset>0x40c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TEA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>TED</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TELD</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TEMD</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ASE</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BSE</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CBRUR3</name>
        <addressOffset>0x410</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SUV</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>DUV</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSAR4</name>
        <addressOffset>0x414</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCR5</name>
        <addressOffset>0x418</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TEIE</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTCIE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRTIE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BTIE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCIE</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PL</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>BEX</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HEX</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WEX</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWRQ</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTBR2</name>
        <addressOffset>0x41c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSEL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>SBUS</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DBUS</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTCR5</name>
        <addressOffset>0x428</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SINC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DINC</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SSIZE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DSIZE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SINCOS</name>
            <bitOffset>8</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DINCOS</name>
            <bitOffset>10</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SBURST</name>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DBURST</name>
            <bitOffset>15</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>TLEN</name>
            <bitOffset>18</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>PKE</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PAM</name>
            <bitOffset>26</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>TRGM</name>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SWRM</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BWM</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CDAR4</name>
        <addressOffset>0x430</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CLAR3</name>
        <addressOffset>0x434</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CBNDTR5</name>
        <addressOffset>0x43c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BNDT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>17</bitWidth>
          </field>
          <field>
            <name>BRSUM</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRDUM</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BRC</name>
            <bitOffset>20</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CMDR1</name>
        <addressOffset>0x440</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MDR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
