modm-ext/archive-stmicro-svd/header_stm32h755xx.svd
      <register>
        <name>CMAR2</name>
        <addressOffset>0x44c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CBRUR4</name>
        <addressOffset>0x450</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SUV</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>DUV</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSAR5</name>
        <addressOffset>0x454</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTBR3</name>
        <addressOffset>0x45c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSEL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>SBUS</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DBUS</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CDAR5</name>
        <addressOffset>0x470</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CLAR4</name>
        <addressOffset>0x474</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CMDR2</name>
        <addressOffset>0x480</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MDR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CMAR3</name>
        <addressOffset>0x48c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CBRUR5</name>
        <addressOffset>0x490</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SUV</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>DUV</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTBR4</name>
        <addressOffset>0x49c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSEL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>SBUS</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DBUS</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CLAR5</name>
        <addressOffset>0x4b4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CMDR3</name>
        <addressOffset>0x4c0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MDR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CMAR4</name>
        <addressOffset>0x4cc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CTBR5</name>
        <addressOffset>0x4dc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TSEL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>SBUS</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DBUS</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CMDR4</name>
        <addressOffset>0x500</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MDR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CMAR5</name>
        <addressOffset>0x50c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MAR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CMDR5</name>
        <addressOffset>0x540</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MDR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>DMA2D</name>
      <baseAddress>0x52001000</baseAddress>
      <register>
        <name>CR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>START</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SUSP</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ABORT</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>LOM</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TEIE</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCIE</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TWIE</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CAEIE</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTCIE</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CEIE</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MODE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ISR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>TEIF</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCIF</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TWIF</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CAEIF</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTCIF</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CEIF</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IFCR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CTEIF</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTCIF</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CTWIF</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CAECIF</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CCTCIF</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CCEIF</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGMAR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGOR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LO</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGMAR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGOR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LO</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGPFCCR</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CM</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>CCM</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>START</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CS</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>AM</name>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CSS</name>
            <bitOffset>18</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>AI</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RBS</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ALPHA</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCOLR</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGPFCCR</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CM</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>CCM</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>START</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CS</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>AM</name>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>AI</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RBS</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ALPHA</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCOLR</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCMAR</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCMAR</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OPFCCR</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CM</name>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>SB</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AI</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RBS</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OCOLR</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE_4</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>GREEN_4</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>GREEN_3</name>
            <bitOffset>5</bitOffset>
            <bitWidth>6</bitWidth>
          </field>
          <field>
            <name>RED_4</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>RED_3</name>
            <bitOffset>10</bitOffset>
            <bitWidth>7</bitWidth>
          </field>
          <field>
            <name>RED_2</name>
            <bitOffset>11</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA_4</name>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ALPHA_3</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RED_1</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA_1</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OMAR</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>MA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OOR</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LO</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>NLR</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>NL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>PL</name>
            <bitOffset>16</bitOffset>
            <bitWidth>14</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>LWR</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LW</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>AMTCR</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DT</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.0</name>
        <addressOffset>0x400</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.1</name>
        <addressOffset>0x404</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.2</name>
        <addressOffset>0x408</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.3</name>
        <addressOffset>0x40c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.4</name>
        <addressOffset>0x410</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.5</name>
        <addressOffset>0x414</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.6</name>
        <addressOffset>0x418</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.7</name>
        <addressOffset>0x41c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.8</name>
        <addressOffset>0x420</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.9</name>
        <addressOffset>0x424</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.10</name>
        <addressOffset>0x428</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.11</name>
        <addressOffset>0x42c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.12</name>
        <addressOffset>0x430</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.13</name>
        <addressOffset>0x434</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.14</name>
        <addressOffset>0x438</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.15</name>
        <addressOffset>0x43c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.16</name>
        <addressOffset>0x440</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.17</name>
        <addressOffset>0x444</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.18</name>
        <addressOffset>0x448</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.19</name>
        <addressOffset>0x44c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.20</name>
        <addressOffset>0x450</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.21</name>
        <addressOffset>0x454</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.22</name>
        <addressOffset>0x458</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.23</name>
        <addressOffset>0x45c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.24</name>
        <addressOffset>0x460</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.25</name>
        <addressOffset>0x464</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.26</name>
        <addressOffset>0x468</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.27</name>
        <addressOffset>0x46c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.28</name>
        <addressOffset>0x470</addressOffset>
        <size>0x20</size>
      </register>
