modm-ext/archive-stmicro-svd/header_stm32h755xx.svd
      <register>
        <name>JDR2</name>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>JDATA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>JDR3</name>
        <addressOffset>0x88</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>JDATA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>JDR4</name>
        <addressOffset>0x8c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>JDATA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>AWD2CR</name>
        <addressOffset>0xa0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>AWD2CH</name>
            <bitOffset>0</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>AWD3CR</name>
        <addressOffset>0xa4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>AWD3CH</name>
            <bitOffset>0</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>LTR2</name>
        <addressOffset>0xb0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HTR2</name>
        <addressOffset>0xb4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LTR3</name>
        <addressOffset>0xb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HTR3</name>
        <addressOffset>0xbc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DIFSEL</name>
        <addressOffset>0xc0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DIFSEL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CALFACT</name>
        <addressOffset>0xc4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CALFACT_S</name>
            <bitOffset>0</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
          <field>
            <name>CALFACT_D</name>
            <bitOffset>16</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CALFACT2</name>
        <addressOffset>0xc8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LINCALFACT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>30</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>ADC3_COMMON</name>
      <baseAddress>0x58026300</baseAddress>
      <register>
        <name>CSR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ADRDY_MST</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOSMP_MST</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOC_MST</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOS_MST</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OVR_MST</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JEOC_MST</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JEOS_MST</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD1_MST</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD2_MST</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD3_MST</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JQOVF_MST</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADRDY_SLV</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOSMP_SLV</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOC_SLV</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOS_SLV</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OVR_SLV</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JEOC_SLV</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JEOS_SLV</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD1_SLV</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD2_SLV</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>AWD3_SLV</name>
            <bitOffset>25</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>JQOVF_SLV</name>
            <bitOffset>26</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CCR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DUAL</name>
            <bitOffset>0</bitOffset>
            <bitWidth>5</bitWidth>
          </field>
          <field>
            <name>DELAY</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DAMDF</name>
            <bitOffset>14</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CKMODE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>PRESC</name>
            <bitOffset>18</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>VREFEN</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSEN</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>VBATEN</name>
            <bitOffset>24</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CDR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RDATA_MST</name>
            <bitOffset>0</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>RDATA_SLV</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CDR2</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>RDATA_ALT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>HSEM</name>
      <baseAddress>0x58026400</baseAddress>
      <register>
        <name>R.0</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.1</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.2</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.3</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.4</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.5</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.6</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.7</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.8</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.9</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.10</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.11</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.12</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.13</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.14</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.15</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.16</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.17</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.18</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.19</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.20</name>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.21</name>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.22</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.23</name>
        <addressOffset>0x5c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>R.24</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PROCID</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>COREID</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>LOCK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
